@ECHO OFF
chcp 65001 > nul

mkdir "1 курс\1 семестр\Алгебра и геометрия\"
mkdir "1 курс\1 семестр\Мат анализ\"
mkdir "1 курс\1 семестр\Основы программирования\"
mkdir "1 курс\1 семестр\Архитектура ВС\"

echo "Балыкина Юлия Ефимовна"      > "1 курс\1 семестр\Алгебра и геометрия\readme.txt"
echo "Платонов Алексей Викторович" > "1 курс\1 семестр\Мат анализ\readme.txt"
echo "Погожев Сергей Владимирович" > "1 курс\1 семестр\Основы программирования\readme.txt"
echo "Моисеев Игорь Анатольевич"   > "1 курс\1 семестр\Архитектура ВС\readme.txt"

mkdir "1 курс\2 семестр\Алгебра и геометрия"
mkdir "1 курс\2 семестр\Мат анализ"
mkdir "1 курс\2 семестр\ Основы программирования"